na423-hw8-flat-plate/yplus05/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)		//vertex 0
    (1 0 0)		//vertex 1
    (1 1 0)		//vertex 2
    (0 1 0)		//vertex 3
    (0 0 0.1)		//vertex 4
    (1 0 0.1)		//vertex 5
    (1 1 0.1)		//vertex 6
    (0 1 0.1)		//vertex 7
    (-0.1 0 0)		//vertex 8
    (-0.1 1 0)		//vertex 9
    (-0.1 1 0.1)	//vertex 10
    (-0.1 0 0.1)	//vertex 11
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (400 400 1) simpleGrading (1 8000 1)
    hex (8 0 3 9 11 4 7 10) (40 400 1) simpleGrading (1 8000 1)
);

edges
(
);

boundary
(
    top            
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (10 7 3 9)
        );
    }
    inlet           
    {
        type patch;
        faces
        (
            (8 11 10 9)
        );
    }
    outlet          
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    plate         
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    upstream 
    {
        type patch;
        faces
        (
            (8 0 4 11)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
	    (8 9 3 0)
	    (4 7 10 11)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
