na423-hw8-flat-plate/yplus05/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            patch;
        nFaces          440;
        startFace       351160;
    }
    inlet
    {
        type            patch;
        nFaces          400;
        startFace       351600;
    }
    outlet
    {
        type            patch;
        nFaces          400;
        startFace       352000;
    }
    plate
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       352400;
    }
    upstream
    {
        type            patch;
        nFaces          40;
        startFace       352800;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          352000;
        startFace       352840;
    }
)

// ************************************************************************* //
